fsugny/Tetris-Table/audio/stm32f4_audio.cpp

//---------------------------------------------------------------------------------------------------------
//---------------------------------------------------------------------------------------------------------
#include "stm32f4xx.h"
#include "stm32f4_audio.h"
#include <stdio.h>

//---------------------------------------------------------------------------------------------------------
//---------------------------------------------------------------------------------------------------------

extern "C" {

//---------------------------------------------------------------------------------------------------------
//---------------------------------------------------------------------------------------------------------

#include "stm32f4_discovery_audio_codec.h"

//---------------------------------------------------------------------------------------------------------
//---------------------------------------------------------------------------------------------------------

uint16_t EVAL_AUDIO_GetSampleCallBack(void)
{
    printf("EVAL_AUDIO_GetSampleCallBack()\n");
    return 0;
}

//---------------------------------------------------------------------------------------------------------
//---------------------------------------------------------------------------------------------------------

void EVAL_AUDIO_TransferComplete_CallBack(uint16_t* pBuffer, uint32_t Size)
{
    printf("EVAL_AUDIO_TransferComplete_CallBack()\n");
    printf("Buffer : %x  Size : %x\n",(void*)pBuffer,Size);
}

//---------------------------------------------------------------------------------------------------------
//---------------------------------------------------------------------------------------------------------

void EVAL_AUDIO_HalfTransfer_CallBack(uint32_t pBuffer, uint32_t Size)
{
    printf("EVAL_AUDIO_HalfTransfer_CallBack()\n");
    printf("Buffer : %x  Size : %x\n",(void*)pBuffer,Size);
}

//---------------------------------------------------------------------------------------------------------
//---------------------------------------------------------------------------------------------------------

void EVAL_AUDIO_Error_CallBack(void* pData)
{
    printf("EVAL_AUDIO_Error_CallBack()\n");
    while (1)
    {}
}

//---------------------------------------------------------------------------------------------------------
//---------------------------------------------------------------------------------------------------------

uint32_t Codec_TIMEOUT_UserCallback(void)
{
    printf("Codec_TIMEOUT_UserCallback()\n");
    return (0);
}

}   // End of extern C

//---------------------------------------------------------------------------------------------------------
//---------------------------------------------------------------------------------------------------------

stm32f4_audio::stm32f4_audio()
{
}

//---------------------------------------------------------------------------------------------------------
//---------------------------------------------------------------------------------------------------------

stm32f4_audio::~stm32f4_audio()
{
}

//---------------------------------------------------------------------------------------------------------
//---------------------------------------------------------------------------------------------------------

void stm32f4_audio::init( uint8_t volume, uint32_t audioFreq )
{
  EVAL_AUDIO_SetAudioInterface( AUDIO_INTERFACE_I2S );

  if ( !EVAL_AUDIO_Init(OUTPUT_DEVICE_AUTO, volume, audioFreq) )
      printf("Stm32F4 Audio : Audio Init Ok!\n");
  else
      printf("Stm32F4 Audio : Audio Init Error...\n");
}

//---------------------------------------------------------------------------------------------------------
//---------------------------------------------------------------------------------------------------------

void stm32f4_audio::playBuffer( uint16_t * buffer, uint32_t buffer_size )
{
    if ( !EVAL_AUDIO_Play( buffer, buffer_size ) )
        printf("Stm32F4 Audio : Play Start Ok\n");
    else
        printf("Stm32F4 Audio : Play Start Error\n");
}

//---------------------------------------------------------------------------------------------------------
//---------------------------------------------------------------------------------------------------------

void stm32f4_audio::stop()
{
    if ( !EVAL_AUDIO_Stop( CODEC_PDWN_HW ) )
        printf("Stm32F4 Audio : Play Stop Ok\n");
    else
        printf("Stm32F4 Audio : Play Stop Error\n");
    if ( !EVAL_AUDIO_DeInit() )
        printf("Stm32F4 Audio : DeInit Ok\n");
    else
        printf("Stm32F4 Audio : DeInit Error\n");
}

//---------------------------------------------------------------------------------------------------------
//---------------------------------------------------------------------------------------------------------
